demo/test.yml
modules:
  blazemeter:
    token: 741b76d7794fac6eaecf8330:4e63d0732f654fac5eef8b3617af0b325d8f751ff86fa6a8d28fca5b250f2abb7803a301

reporting:
- module: blazemeter
  report-name: Jenkins Build 1
  test: Taurus Demo
  project: Taurus Tests Group
  upload-artifacts: true  # upload artifacts when test is finished

execution:
- concurrency: 10
  ramp-up: 1m
  hold-for: 1m30s
  scenario: simple

scenarios:
  simple:
    think-time: 0.75
    requests:
    - http://blazedemo.com/
    - http://blazedemo.com/vacation.html